Tekla.Structures.Identifier.ID2
Secondary identifier.

Tekla.Structures.Identifier.#ctor
Constructs an empty indentifier.

Tekla.Structures.Identifier.#ctor(System.Int32)
Constructs an identifier with the given ID.
ID: The ID to be used.

Tekla.Structures.Identifier.#ctor(System.Guid)
Constructs an identifier with the given GUID.
GUID: The GUID to be used.

Tekla.Structures.Identifier.#ctor(System.String)
Constructs an identifier with the given GUID string.
GUID: The GUID to be used.

Tekla.Structures.Identifier.GetIdentifierByGUIDFromModel(System.String)
Returns an identifier instance that has the given GUID in the model.
GUID: The GUID to look for in the model.
Returns: The identifier of the GUID, or null if not found.

Tekla.Structures.Identifier.Equals(Tekla.Structures.Identifier)
Compares the identifier with another identifier instance.
OtherIdentifier: The identifier to compare with.
Returns: True if the identifiers are equal, false otherwise.

Tekla.Structures.Identifier.Equals(System.Object)
Compares the identifier with another object instance.
OtherObject: The object to compare with.
Returns: True if the objects are equal, false otherwise.

Tekla.Structures.Identifier.SetGuid(System.String)
Sets GUID without resetting ID.
Returns: True if the identifier seems to be valid.